Revit 2026 API

# ComponentRepeaterIterator Class

---

A slot iterator for ComponentRepeater.

SystemObject Autodesk.Revit.DBComponentRepeaterIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ComponentRepeaterIterator : IEnumerator<ComponentRepeaterSlot>
```
```vb
Public Class ComponentRepeaterIterator
	Implements IEnumerator(Of ComponentRepeaterSlot)
```
```cpp
public ref class ComponentRepeaterIterator : IEnumerator<ComponentRepeaterSlot^>
```
```fsharp
type ComponentRepeaterIterator =
    class
        interface IEnumerator<ComponentRepeaterSlot>
    end
```

The ComponentRepeaterIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Gets the item at the current position of the iterator. |
|  | CurrentObject |  |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ComponentRepeaterIterator |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCurrent | Returns the current repeater slot. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsDone | Identifies if the iteration has completed. |
|  | MoveNext | Increments the iterator to the next item. |
|  | Reset | Resets the iterator to the initial state. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace